<!-- задание №1 -->

<?php

$a = 3;
$i = 0;

while ($i <= 100) {
    if ($i % $a == 0) {
        echo $i . "<br>";
    }
    $i++;
}

?>

<hr>

<!-- задание №2 -->

<?php

$a = 10;
$i = 0;

do {
    if ($i === 0) {
        echo $i . " - ноль.<br>";
    } elseif ($i % 2 === 0) {
        echo $i . " - четное число.<br>";
    } else {
        echo $i . " - нечетное число.<br>";
    }
    $i++;
} while ($i <= $a);

?>

<hr>

<!-- задание №3 -->

<?php

$arr = [
    'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Рязанская область' => ['Рязань', 'Тюшево', 'Турлатово']
];

foreach ($arr as $key => $value) {
    echo $key . ":<br>";
    echo implode(", ", $value) . ".<br>";
}

?>

<hr>

<!-- задание №4 -->

<?php

$str = "Текст";

$alfabet = [
    'а' => 'a',   'б' => 'b',   'в' => 'v',
    'г' => 'g',   'д' => 'd',   'е' => 'e',
    'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
    'и' => 'i',   'й' => 'y',   'к' => 'k',
    'л' => 'l',   'м' => 'm',   'н' => 'n',
    'о' => 'o',   'п' => 'p',   'р' => 'r',
    'с' => 's',   'т' => 't',   'у' => 'u',
    'ф' => 'f',   'х' => 'h',   'ц' => 'c',
    'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
    'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
    'э' => 'e',   'ю' => 'yu',  'я' => 'ya'
    ];
    
function translate ($str, $alfabet) {
    $str_little = mb_strtolower($str);
    return strtr($str_little, $alfabet);
}

echo $str . "<br>";
echo translate($str,$alfabet);

?>

<hr>

<!-- задание №5 -->

<?php

$str = "Текст с пробелами";

function change ($str) {
    $str_ch = str_replace(' ', '_', $str);
    return $str_ch;
}

echo change($str);

?>

<hr>
<!-- задание №7-->

<?php

$arr = [
    'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Рязанская область' => ['Рязань', 'Тюшево', 'Турлатово']
];

foreach ($arr as $key => $value) {
    echo $key . ":<br>";
    for ($i=0; $i <= count($value); $i++) {
        if ($value[$i][0] =='К'){
            echo $value[$i] . "<br>";
        }
    }
    //??
}

?>

<hr>